{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Axles",
    "1": "B-BodyType",
    "2": "B-Brakes",
    "3": "B-Color",
    "4": "B-CrewCab",
    "5": "B-EngineMake",
    "6": "B-FuelType",
    "7": "B-GearRatio",
    "8": "B-HasReefer",
    "9": "B-Make",
    "10": "B-Miles",
    "11": "B-SleeperCab",
    "12": "B-TransmissionSpeeds",
    "13": "B-TransmissionType",
    "14": "B-Year",
    "15": "I-Axles",
    "16": "I-BodyType",
    "17": "I-Brakes",
    "18": "I-CrewCab",
    "19": "I-EngineMake",
    "20": "I-GearRatio",
    "21": "I-HasReefer",
    "22": "I-Miles",
    "23": "I-SleeperCab",
    "24": "I-TransmissionSpeeds",
    "25": "I-TransmissionType"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Axles": 0,
    "B-BodyType": 1,
    "B-Brakes": 2,
    "B-Color": 3,
    "B-CrewCab": 4,
    "B-EngineMake": 5,
    "B-FuelType": 6,
    "B-GearRatio": 7,
    "B-HasReefer": 8,
    "B-Make": 9,
    "B-Miles": 10,
    "B-SleeperCab": 11,
    "B-TransmissionSpeeds": 12,
    "B-TransmissionType": 13,
    "B-Year": 14,
    "I-Axles": 15,
    "I-BodyType": 16,
    "I-Brakes": 17,
    "I-CrewCab": 18,
    "I-EngineMake": 19,
    "I-GearRatio": 20,
    "I-HasReefer": 21,
    "I-Miles": 22,
    "I-SleeperCab": 23,
    "I-TransmissionSpeeds": 24,
    "I-TransmissionType": 25
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.53.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
